УчетВУправляющихДляГит1/src/Documents/КВП_СвидетельствоОРегистрацииПоМестуПребывания/КВП_СвидетельствоОРегистрацииПоМестуПребывания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_СвидетельствоОРегистрацииПоМестуПребывания</name>
  <basedOn>Document.КВП_ЗаявлениеОРегистрацииПоМестуПребывания</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Проживающий</name>
    <type>
      <types>CatalogRef.УПЖКХ_Жильцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КВП_ЗаявлениеОРегистрацииПоМестуПребывания</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/КВП_РазмерБумаги/КВП_РазмерБумаги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КВП_РазмерБумаги</name>
  <enumValues>
    <name>А4</name>
  </enumValues>
  <enumValues>
    <name>А5</name>
  </enumValues>
  <enumValues>
    <name>А6</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/КВП_СвидетельствоОРегистрацииПоМестуПребывания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Печать

#Область Печать

// Функция возвращая табличный документ на основе форм.
//
Функция ПечатьФорм(МассивОбъектов, ОбъектыПечати, НомерФормы)
	
	РезДокумент = Новый ТабличныйДокумент;
	
	Для Каждого Объект Из МассивОбъектов Цикл
	
		ТабДокумент = Новый ТабличныйДокумент;
		
		Отчет = Отчеты.КВП_ФормыРегистрационногоУчета.Создать();
		
		Отчет.Организация  = Объект.Организация;
		Отчет.Дата         = Объект.Дата;
		Отчет.РазмерБумаги = Перечисления.КВП_РазмерБумаги.А4;
		
		СтрокаТч = Отчет.ТаблицаДляПечати.Добавить();
		
		СтрокаТч.НомерФормы  = НомерФормы;
				
		СтрокаТч.Проживающий = Объект.Проживающий;
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("НомерСвидетельства", Объект.Номер);
		ДополнительныеПараметры.Вставить("ДатаНачалаРегистрации",Объект.ДатаНачалаРегистрации);
		ДополнительныеПараметры.Вставить("ДатаОкончанияРегистрации",Объект.ДатаОкончанияРегистрации);
		
		СтрокаТч.ДопПараметрыПечати = ЗначениеВСтрокуВнутр(ДополнительныеПараметры);
		
		Отчет.ОбновитьОтчет(ТабДокумент);
		
		РезДокумент.Вывести(ТабДокумент);
		
	КонецЦикла;
	
	Возврат РезДокумент;
	
КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//  ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую;
//  МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать;
//  ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//  КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы;
//  ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УПЖКХ_ТиповыеМетодыСервер.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ф3") Тогда
		УПЖКХ_ТиповыеМетодыСервер.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Ф3", "Свидетельство о регистрации по месту пребывания", ПечатьФорм(МассивОбъектов, ОбъектыПечати, "Ф3"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
